
/*사용자 이름 (한글만 허용 , 글자수 1~4 )*/
var username_regex = /^[가-힣]{1,4}$/;
/*사용자 아이디(영어,숫자,4~20글자)*/
var userid_regex = /^[0-9a-zA-Z]{4,20}$/;
//비밀번호(영어, 숫자,4~20글자)*/
var userpw_regex = /^[0-9a-zA-Z]{4,20}$/;
//휴대폰 번호
var phone_regex =  /^[0-9]{3,4}$/;
//우편번호
//var postal_regex = /^[0-9]{5,5}$/;
//비밀번호(영어,숫자,특수문자 반드시 포함한다)*/
//var userpw_regex = /^(?=.*[a-zA-Z])((?=.*\d)|(?=.*\w)).{4,20}$/;
//별명
//var usernick_regex=/^[0-9a-zA-Z가-힣]{4,20}$/;
//이메일 @앞 
//var email1_regex = /^([\w-]+(?:\.[\w-]+)*)$/;
//이메일 뒷자리
//var email2_regex = /^((?:[\w-]+\.)*\w[\w-]{0,66})\.([a-z]{2,6}(?:\.[a-z]{2})?)$/;





